if __name__ == '__main__':
    print(2000)
    print(250.3)
    print(200, 23.2, sep="&")
    print(200 + 23.2)

    print(-200) # унарный оператор обратного числа (есть еще и + унарный)
    print(200 + 24.2)
    print(200 - 24.2)
    print(200 * 24.2)
    print(200 / 24.2)
    print(200 // 24.2) # деление без остатка
    print(200 % 24.2) # остаток
    print(200 ** 24.2) # степень
    print(complex(1, 2) + complex(2,1))
    print((3+2j) ** 2)

    # 2.2.7 solution
    print(f'дата центр {68796/(4 * 117 * 21)}')
    print(f'mb {21 * 7 * ((16 * 1024) - (4 * 117 * 30))}')
    print(344568//1024, 344568%1024, sep=",")
